app/controllers/pokemons_controller.rb

SELECT "pokemons".* FROM "pokemons"
SELECT COUNT(*) FROM "pokemons"
---
  def index
    session[:page_number] = params[:page] || 1
    response = RestClient.get("https://pokeapi.co/api/v2/pokemon/")
    data = JSON.parse(response.body)
    create_from_api(data)
    @pokemons = Pokemon.all.page(params[:page] || 1).per(6)

SELECT "pokemons".* FROM "pokemons" WHERE "pokemons"."name" = $1 LIMIT $2  [["name", "bulbasaur"], ["LIMIT", 1]]
INSERT INTO "pokemons" ("name", "created_at", "updated_at", "url", "imagen", "weight") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
UPDATE "pokemons" SET "updated_at" = $1, "abilities" = $2 WHERE "pokemons"."id" = $3  [["updated_at", "2023-01-27 22:58:43.522746"], ["abilities", "{torrent,rain-dish}"], ["id", 1833]]
---
  def create_from_api(pokemon_data)
    pokemon_data["results"].each do |pokemon|
      if Pokemon.find_by(name: pokemon["name"]).nil?
        response = RestClient.get(pokemon["url"])
        data = JSON.parse(response.body)
        image = data["sprites"]["back_default"]
        weight = data["weight"]
        current_pokemon = Pokemon.create(name: pokemon["name"], url: pokemon["url"], imagen: image, weight: weight)
        abilities = data["abilities"]
        abilities.each do |ability|
          name = ability["ability"]["name"]
          current_pokemon.abilities << name
        end
        current_pokemon.save